# Books (CORE)

**Marco Jimenez 5/21/2022**

In [14]:
# PyMySQUL and SQLAlchemy
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Creating connection string
connection_str = "mysql+pymysql://root:root@localhost/books"

In [15]:
# Creating engine
engine = create_engine(connection_str)

In [16]:
# Creating Database
create_database(connection_str)

In [17]:
# Double checking that the database already exists using course provided code
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

Adding tables with dataframes

In [18]:
# Reading in dataframes
import pandas as pd
users_df = pd.read_csv('https://docs.google.com/spreadsheets/d/1_c2WTx_eiH8pUM-PTgyt7T4aIl1A3Cp1ukPVPEijoYc/gviz/tq?tqx=out:csv&sheet=users')
books_df = pd.read_csv('https://docs.google.com/spreadsheets/d/1_D-vW7GXiQfG6D9nzjscgVctKLb6TZl_o8ERNH_tet8/gviz/tq?tqx=out:csv&sheet=books')
authors_df = pd.read_csv('https://docs.google.com/spreadsheets/d/17rABPt5eaIxfhGO75dYCbH-5IloKsAR0HH9V6VC43ZI/gviz/tq?tqx=out:csv&sheet=authors')
favorites_df = pd.read_csv('https://docs.google.com/spreadsheets/d/1SLb3RAhcrZsPWRwR0_njWX7KssUYZ16JFsVqBkSU2GI/gviz/tq?tqx=out:csv&sheet=favorite')
users_df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [20]:
# Adding dataframes to tables
users_df.to_sql('users', engine, if_exists = 'replace')
books_df.to_sql('books', engine, if_exists = 'replace')
authors_df.to_sql('authors', engine, if_exists = 'replace')
favorites_df.to_sql('favorites', engine, if_exists = 'replace')

In [27]:
# Double checking table exists with a simple query
q = """
SELECT *
FROM books;
"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

In [28]:
# Displaying tables
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [36]:
# Final task step. Title's of all of John Doe's favorite books
q = """
SELECT b.title, f.user_id
FROM books AS b
JOIN favorites AS f
ON b.id = f.book_id
WHERE f.user_id = (SELECT u.id 
                   FROM users AS u
                   WHERE(u.last_name = "Doe" AND u.first_name = "John"));
"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1